log_sendUser.xml

Input:
<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:ns1="http://php2.local"><env:Body><ns1:sendUser><sendRequest/></ns1:sendUser></env:Body></env:Envelope>

---
sendRequest:
O:8:"stdClass":0:{}